### PANDAS, PYTHON

# How to use Pandas Count and Value_Counts

[Website](https://kanoki.org/2020/03/09/how-to-use-pandas-count-and-value_counts/)

In [2]:
import numpy as np
import pandas as pd

Let’s create a dataframe first with three columns "A", "B" and "C" and values randomly filled with any integer between 0 and 5 inclusive

In [3]:
df = pd.DataFrame(np.random.randint(0, 5, (5, 3)), columns=["A", "B","C"])
df.replace(1, np.nan, inplace=True)
df

     A    B    C
0  2.0  NaN  4.0
1  NaN  4.0  NaN
2  4.0  4.0  2.0
3  4.0  2.0  3.0
4  3.0  2.0  0.0

## Pandas Count Number of Rows and Columns

First find out the shape of dataframe i.e. number of rows and columns in this dataframe

In [4]:
df.shape

(5, 3)

Here 5 is the number of rows and 3 is the number of columns

## Pandas Count Values for each Column

We will use dataframe count() function to count the number of Non Null values in the dataframe.

We will select axis =0 to count the values in each Column

In [5]:
df.count(0)

A    4
B    4
C    4
dtype: int64

You can count the non NaN values in the above dataframe and match the values with this output

## Pandas Count Values for each row

Change the axis = 1 in the count() function to count the values in each row. All None, NaN, NaT values will be ignored

In [6]:
df.count(1)

0    2
1    1
2    3
3    3
4    3
dtype: int64

## Pandas Count Along a level in multi-index

Now we will see how Count() function works with Multi-Index dataframe and find the count for each level

Let’s create a Multi-Index dataframe with Name and Age as Index and Column as Salary

In [7]:
idx = pd.MultiIndex.from_tuples([('Chris',48), ('Brian',np.nan), ('David',65),('Chris',34),('John',28)], names=['Name', 'Age'])
col = ['Salary']

df = pd.DataFrame([120000, 140000, 90000, 101000, 59000], idx, col)
df

           Salary
Name  Age
Chris 48   120000
Brian NaN  140000
David 65    90000
Chris 34   101000
John  28    59000

In this Multi-Index we will find the Count of Age and Salary for level Name

You can set the level parameter as column “Name” and it will show the count of each Name Age and Salary

Brian’s Age is missing in the above dataframe that’s the reason you see his Age as 0 i.e. No value available for his age but his Salary is present so Count is 1.

In [8]:
df.count(level='Name')

<ipython-input-8-95285bb80903>:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.count(level=1) should use df.groupby(level=1).count().
  df.count(level='Name')

       Salary
Name
Brian       1
Chris       2
David       1
John        1

use groupby instead df.count(level=1) should use df.groupby(level=1).count()

In [9]:
df.groupby(level='Name').count()

       Salary
Name
Brian       1
Chris       2
David       1
John        1

## Pandas Count Groupby

You can also do a group by on Name column and use count function to aggregate the data and find out the count of the Names in the above Multi-Index Dataframe function

Note: You have to first reset_index() to remove the multi-index in the above dataframe

In [10]:
df = df.reset_index()
df

    Name   Age  Salary
0  Chris  48.0  120000
1  Brian   NaN  140000
2  David  65.0   90000
3  Chris  34.0  101000
4   John  28.0   59000

In [11]:
df.groupby(by='Name').agg('count')

       Age  Salary
Name
Brian    0       1
Chris    2       2
David    1       1
John     1       1

Alternatively, we can also use the count() method of pandas groupby to compute count of group excluding missing values

In [12]:
df.groupby(by='Name').count()

       Age  Salary
Name
Brian    0       1
Chris    2       2
David    1       1
John     1       1

if you want to write the frequency back to the original dataframe then use transform() method. You can learn more about transform here.

In [13]:
df['freq'] = df.groupby(by='Name')['Name'].transform('count')
df

    Name   Age  Salary  freq
0  Chris  48.0  120000     2
1  Brian   NaN  140000     1
2  David  65.0   90000     1
3  Chris  34.0  101000     2
4   John  28.0   59000     1

In [16]:
df['Name'].map(df['Name'].value_counts())

0    2
1    1
2    1
3    2
4    1
Name: Name, dtype: int64

## Pandas Count rows with Values

There is another function called value_counts() which returns a series containing count of unique values in a Series or Dataframe Columns

Let’s take the above case to find the unique Name counts in the dataframe

In [17]:
#value counts
# Remove the multi-index using reset_index() in the above dataframe
df=df.reset_index()
df['Name'].value_counts()

Chris    2
Brian    1
David    1
John     1
Name: Name, dtype: int64

## Sort by Frequency

You can also sort the count using the sort parameter

In [18]:
#sort by frequency
df['Name'].value_counts(sort=True)

Chris    2
Brian    1
David    1
John     1
Name: Name, dtype: int64

## Sort by Ascending Order

Sort the frequencies in Ascending order

In [19]:
# sort by ascending
df['Name'].value_counts(sort=True, ascending=True)

Brian    1
David    1
John     1
Chris    2
Name: Name, dtype: int64

## Value Counts Percentage or Relative Count

You can also get the relative frequency or percentage of each unique values using normalize parameters

In [20]:
# Relative counts - find percentage
df['Name'].value_counts(normalize=True)

Chris    0.4
Brian    0.2
David    0.2
John     0.2
Name: Name, dtype: float64

Now Chris is 40% of all the values and rest of the Names are 20% each

## Binning

Rather than counting you can also put these values into bins using the bins parameter

This works only for Numeric data

In [21]:
df['Salary'].value_counts(bins=2)

(99500.0, 140000.0]     3
(58918.999, 99500.0]    2
Name: Salary, dtype: int64

## Pandas Value Count for Multiple Columns

value_counts() method can be applied only to series but what if you want to get the unique value count for multiple columns?

No need to worry, You can use apply() to get the count for each of the column using value_counts()

Let’s create a new dataframe

In [22]:
df = pd.DataFrame(np.random.randint(0, 2, (5, 3)), columns=["A", "B","C"])
df

   A  B  C
0  1  1  0
1  0  0  1
2  1  1  0
3  1  1  1
4  1  1  1

Apply pd.Series.value_counts to all the columns of the dataframe, it will give you the count of unique values for each row

In [23]:
df.apply(pd.Series.value_counts, axis=1)

     0    1
0  1.0  2.0
1  2.0  1.0
2  1.0  2.0
3  NaN  3.0
4  NaN  3.0

Now change the axis to 0 and see what result you get, It gives you the count of unique values for each column

In [24]:
df.apply(pd.Series.value_counts, axis=0)

   A  B  C
1  4  4  3
0  1  1  2

Alternatively, you can also use melt() to Unpivot a DataFrame from wide to long format and crosstab() to count the values for each column

In [25]:
df1 = df.melt(var_name='columns', value_name='values')
pd.crosstab(index=df1['values'], columns=df1['columns'])

columns  A  B  C
values
0        1  1  2
1        4  4  3

## Pandas Count Specific Values in Column

You can also get the count of a specific value in dataframe by boolean indexing and sum the corresponding rows

If you see clearly it matches the last row of the above result i.e. count of value 1 in each column

In [26]:
# By column
df[df == 1].sum(axis=0)

A    4.0
B    4.0
C    3.0
dtype: float64

## Pandas Count Specific Values in rows

Now change the axis to 1 to get the count of columns with value 1 in a row

You can see the first row has only 2 columns with value 1 and similarly count for 1 follows for other rows

In [27]:
# By row
df[df == 1].sum(axis=1)

0    2.0
1    1.0
2    2.0
3    3.0
4    3.0
dtype: float64

## Conclusion

Finally we have reached to the end of this post and just to summarize what we have learnt in the following lines:

1. Pandas count value for each row and columns using the dataframe count() function
2. Count for each level in a multi-index dataframe
3. Pandas value_counts() method to find frequency of unique values in a series
4. How to apply value_counts on multiple columns
5. Count a Specific value in a dataframe rows and columns

In [49]:
# dictionary of lists
dict = {'year':["2020", "2021", "2020", "2019","2018"],
        'action': [1, 1, 0.0, 0, 1],
        'comedy':[1, 0, 1, 0, 1]}
df = pd.DataFrame(dict)
df = df.astype({"action": np.int32, "comedy": np.int32}, errors='ignore')
df = df.set_index('year')
df

      action  comedy
year
2020       1       1
2021       1       0
2020       0       1
2019       0       0
2018       1       1

In [29]:
byrow = df[df == 1].sum(axis=1)
byrow

year
2020    2.0
2021    1.0
2020    1.0
2019    0.0
2018    2.0
dtype: float64

In [30]:
bycol = df[df == 1].sum(axis=0)
bycol

action    3.0
comedy    3.0
dtype: float64

In [31]:
grp = df.groupby(by='year')
grp.groups

{'2018': ['2018'], '2019': ['2019'], '2020': ['2020', '2020'], '2021': ['2021']}

In [32]:
sum = grp.sum()
sum

      action  comedy
year
2018       1       1
2019       0       0
2020       1       2
2021       1       0

In [33]:
df.groupby(by='year').agg('sum')

      action  comedy
year
2018       1       1
2019       0       0
2020       1       2
2021       1       0

In [34]:
df.groupby(by='year')['comedy'].agg('sum')

year
2018    1
2019    0
2020    2
2021    0
Name: comedy, dtype: int32

In [35]:
df.groupby(by='year')['comedy'].value_counts()

year  comedy
2018  1         1
2019  0         1
2020  1         2
2021  0         1
Name: comedy, dtype: int64

In [36]:
df.groupby(by='year')['comedy'].count()

year
2018    1
2019    1
2020    2
2021    1
Name: comedy, dtype: int64

In [37]:
df.groupby(by='year').count()

      action  comedy
year
2018       1       1
2019       1       1
2020       2       2
2021       1       1

In [57]:
df.value_counts(sort=True)

A     B         C
Boby  Graduate  23    1
John  Masters   27    1
Mina  Graduate  21    1
dtype: int64

In [55]:
df['action'].value_counts(sort=True)

1    3
0    2
Name: action, dtype: int64

In [39]:
row_sum = df[df == 1].sum(axis=1)
row_sum

year
2020    2.0
2021    1.0
2020    1.0
2019    0.0
2018    2.0
dtype: float64

In [40]:
df['row_sum'] = df.loc[:,:].sum(axis = 1)
df

      action  comedy  row_sum
year
2020       1       1        2
2021       1       0        1
2020       0       1        1
2019       0       0        0
2018       1       1        2

In [41]:
df['row_sum'] = df.loc[:,['action' , 'comedy']].sum(axis = 1)
df

      action  comedy  row_sum
year
2020       1       1        2
2021       1       0        1
2020       0       1        1
2019       0       0        0
2018       1       1        2

In [42]:
df = df.loc[:].eval('Sum = action + comedy')
df

      action  comedy  row_sum  Sum
year
2020       1       1        2    2
2021       1       0        1    1
2020       0       1        1    1
2019       0       0        0    0
2018       1       1        2    2

In [43]:
grp = df.groupby('year')
grp.filter(lambda x: len(x) >= 2)

      action  comedy  row_sum  Sum
year
2020       1       1        2    2
2020       0       1        1    1

In [44]:
# using transform function
grp = df.groupby('year')
sc = lambda x: (x - x.mean()) / x.std()*10
grp.transform(sc)

        action  comedy   row_sum       Sum
year
2020  7.071068     NaN  7.071068  7.071068
2021       NaN     NaN       NaN       NaN
2020 -7.071068     NaN -7.071068 -7.071068
2019       NaN     NaN       NaN       NaN
2018       NaN     NaN       NaN       NaN

In [56]:
# Create a simple dataframe
  
# importing pandas as pd
import pandas as pd
  
# creating a dataframe
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'],
      'B': ['Masters', 'Graduate', 'Graduate'],
      'C': [27, 23, 21]})
  
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [46]:
# values can be an object or a list
df.pivot('A', 'B', 'C')

B     Graduate  Masters
A
Boby      23.0      NaN
John       NaN     27.0
Mina      21.0      NaN

In [47]:
# value is a list
df.pivot(index ='A', columns ='B', values =['C', 'A'])

            C                A
B    Graduate Masters Graduate Masters
A
Boby       23     NaN     Boby     NaN
John      NaN      27      NaN    John
Mina       21     NaN     Mina     NaN

In [48]:
# importing pandas as pd
import pandas as pd
  
# creating a dataframe
df = pd.DataFrame({'A': ['John', 'John', 'Mina'],
      'B': ['Masters', 'Masters', 'Graduate'],
      'C': [27, 23, 21]})
  
  
df.pivot('A', 'B', 'C')

ValueError: Index contains duplicate entries, cannot reshape